docs/integration/SOAP_API_request_response/sendDoc_request2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.edi.service.org/">
  <soapenv:Header />
  <soapenv:Body>
    <soap:sendDoc>
      <!-- Optional: -->
      <user>
        <!-- Optional: -->
        <login>login</login>
        <!-- Optional: -->
        <pass>parol</pass>
      </user>
      <!-- Optional: -->
      <fileName>fileName</fileName>
      <!-- Optional: -->
      <content>PFN0Y...DSUQ</content>
    </soap:sendDoc>
  </soapenv:Body>
</soapenv:Envelope>